## dev plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2.aws_instance.ecs-cluster-runner[0] has changed
  ~ resource "aws_instance" "ecs-cluster-runner" {
      ~ associate_public_ip_address          = true -> false
      ~ cpu_threads_per_core                 = 2 -> 1
        id                                   = "i-04c81f7bc2ea0ae07"
      ~ instance_state                       = "running" -> "pending"
      ~ instance_type                        = "c5a.large" -> "t2.small"
-       public_dns                           = "ec2-54-234-158-156.compute-1.amazonaws.com" -> null
-       public_ip                            = "54.234.158.156" -> null
        tags                                 = {
            "Environment" = "krusty"
            "Name"        = "krusty-test-ecs-cluster-runner"
            "Role"        = "ecs-cluster"
        }
        # (28 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.ecs-cluster-runner[0] must be replaced
-/+ resource "aws_instance" "ecs-cluster-runner" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:830539463303:instance/i-04c81f7bc2ea0ae07" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
      ~ id                                   = "i-04c81f7bc2ea0ae07" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "pending" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0faf46bb40cfcb74e" -> (known after apply)
      ~ private_dns                          = "ip-172-33-1-182.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.33.1.182" -> (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "krusty"
            "Name"        = "krusty-test-ecs-cluster-runner"
            "Role"        = "ecs-cluster"
        }
      ~ tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
+           kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0aded2cbee2348d3b" -> (known after apply)
          ~ volume_size           = 30 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```